src/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ДемоДанные/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Заполнение базы демонстрационными данными: справочники, цены и цепочка документов
// (поступления → перемещение → заказ с резервом → частичная отгрузка по заказу → розничная продажа).
// Все создается в одной транзакции: либо база заполнена целиком, либо не изменена.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет базу демо-данными, если они еще не заполнены.
//
// Возвращаемое значение:
//  Строка - описание результата для пользователя.
//
Функция Заполнить() Экспорт

	Если ДемоДанныеЗаполнены() Тогда
		Возврат НСтр("ru = 'Демо-данные уже заполнены.'");
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		Данные = СоздатьСправочники();
		СоздатьДокументы(Данные);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат НСтр("ru = 'Демо-данные созданы: 3 склада/контрагента, 6 позиций номенклатуры, цены,
		|2 поступления, перемещение, 2 заказа клиентов и 2 реализации.
		|Откройте отчеты «Остатки товаров», «Валовая прибыль» и «ABC-анализ продаж».'");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДемоДанныеЗаполнены()

	Возврат ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоАртикулу("NB-001"));

КонецФункции

Функция СоздатьСправочники()

	Данные = Новый Структура;

	// Единицы измерения (коды ОКЕИ)
	Штука = СоздатьЕдиницу("796", "шт", "Штука");
	Час = СоздатьЕдиницу("356", "ч", "Час");

	// Склады
	Данные.Вставить("ОсновнойСклад", СоздатьСклад("Основной склад", "г. Москва, ул. Складская, д. 1"));
	Данные.Вставить("Магазин", СоздатьСклад("Магазин на Ленина", "г. Москва, ул. Ленина, д. 10"));

	Константы.ОсновнойСклад.Установить(Данные.ОсновнойСклад);
	Константы.СрокРезервированияДней.Установить(3);

	// Контрагенты
	Поставщики = СоздатьГруппу(Справочники.Контрагенты, "Поставщики");
	Покупатели = СоздатьГруппу(Справочники.Контрагенты, "Покупатели");
	Данные.Вставить("Поставщик", СоздатьКонтрагента(Поставщики, "ООО ""ТехноОпт""",
		Перечисления.ЮрФизЛицо.ЮрЛицо, "7701990013", "770101001"));
	Данные.Вставить("КлиентОрганизация", СоздатьКонтрагента(Покупатели, "ООО ""Альфа-Офис""",
		Перечисления.ЮрФизЛицо.ЮрЛицо, "5003123458", "500301001"));
	Данные.Вставить("КлиентИП", СоздатьКонтрагента(Покупатели, "ИП Смирнов Алексей Викторович",
		Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель, "773612345650", ""));

	// Номенклатура
	Компьютеры = СоздатьГруппу(Справочники.Номенклатура, "Ноутбуки и мониторы");
	Периферия = СоздатьГруппу(Справочники.Номенклатура, "Периферия");
	Услуги = СоздатьГруппу(Справочники.Номенклатура, "Услуги");
	Товар = Перечисления.ТипыНоменклатуры.Товар;
	Данные.Вставить("Ноутбук1", СоздатьНоменклатуру(Компьютеры, "NB-001",
		"Ноутбук 15.6"" Core i5 / 16 ГБ / 512 ГБ", Товар, Штука));
	Данные.Вставить("Ноутбук2", СоздатьНоменклатуру(Компьютеры, "NB-002",
		"Ноутбук 14"" Ryzen 5 / 8 ГБ / 256 ГБ", Товар, Штука));
	Данные.Вставить("Монитор", СоздатьНоменклатуру(Компьютеры, "MN-001", "Монитор 27"" IPS 2560x1440", Товар, Штука));
	Данные.Вставить("Клавиатура", СоздатьНоменклатуру(Периферия, "KB-001", "Клавиатура проводная", Товар, Штука));
	Данные.Вставить("Мышь", СоздатьНоменклатуру(Периферия, "MS-001", "Мышь беспроводная", Товар, Штука));
	Данные.Вставить("Настройка", СоздатьНоменклатуру(Услуги, "SV-001", "Настройка рабочего места",
		Перечисления.ТипыНоменклатуры.Услуга, Час));

	Возврат Данные;

КонецФункции

Процедура СоздатьДокументы(Д)

	Сегодня = НачалоДня(ТекущаяДатаСеанса());

	// Прайс-лист (цены продажи)
	Цены = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	Цены.Дата = ДатаДокумента(Сегодня, 30);
	Цены.Комментарий = НСтр("ru = 'Базовый прайс-лист'");
	ДобавитьЦену(Цены, Д.Ноутбук1, 62000);
	ДобавитьЦену(Цены, Д.Ноутбук2, 51000);
	ДобавитьЦену(Цены, Д.Монитор, 21500);
	ДобавитьЦену(Цены, Д.Клавиатура, 990);
	ДобавитьЦену(Цены, Д.Мышь, 790);
	ДобавитьЦену(Цены, Д.Настройка, 1500);
	Цены.Записать(РежимЗаписиДокумента.Проведение);

	// Две поставки ноутбуков по разной цене - чтобы было видно FIFO в себестоимости.
	СоздатьПоступление(ДатаДокумента(Сегодня, 20), Д.Поставщик, Д.ОсновнойСклад, "ТО-1045", ТаблицаПозиций(
		НоваяПозиция(Д.Ноутбук1, 10, 45000),
		НоваяПозиция(Д.Ноутбук2, 5, 38000),
		НоваяПозиция(Д.Монитор, 8, 15000),
		НоваяПозиция(Д.Клавиатура, 50, 600),
		НоваяПозиция(Д.Мышь, 40, 450)));
	СоздатьПоступление(ДатаДокумента(Сегодня, 10), Д.Поставщик, Д.ОсновнойСклад, "ТО-1102", ТаблицаПозиций(
		НоваяПозиция(Д.Ноутбук1, 5, 47000),
		НоваяПозиция(Д.Мышь, 20, 480)));

	// Пополнение магазина с основного склада
	Перемещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	Перемещение.Дата = ДатаДокумента(Сегодня, 8);
	Перемещение.СкладОтправитель = Д.ОсновнойСклад;
	Перемещение.СкладПолучатель = Д.Магазин;
	ДобавитьСтроки(Перемещение, ТаблицаПозиций(НоваяПозиция(Д.Ноутбук1, 2), НоваяПозиция(Д.Мышь, 10)));
	Перемещение.Записать(РежимЗаписиДокумента.Проведение);

	// Заказ организации: резервируется на основном складе
	Заказ = Документы.ЗаказКлиента.СоздатьДокумент();
	Заказ.Дата = ДатаДокумента(Сегодня, 5);
	Заказ.Контрагент = Д.КлиентОрганизация;
	Заказ.Склад = Д.ОсновнойСклад;
	Заказ.ДатаОтгрузки = Сегодня - 3 * 86400;
	Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке;
	Заказ.Комментарий = НСтр("ru = 'Оснащение нового офиса'");
	ДобавитьСтроки(Заказ, ТаблицаПозиций(
		НоваяПозиция(Д.Ноутбук1, 6),
		НоваяПозиция(Д.Монитор, 4),
		НоваяПозиция(Д.Настройка, 6)));
	Заказ.Записать(РежимЗаписиДокумента.Проведение);

	// Частичная отгрузка по заказу (ввод на основании): ноутбуков отгружаем 4 из 6
	Отгрузка = Документы.РеализацияТоваров.СоздатьДокумент();
	Отгрузка.Дата = ДатаДокумента(Сегодня, 4);
	Отгрузка.Заполнить(Заказ.Ссылка);
	Для Каждого СтрокаТоваров Из Отгрузка.Товары Цикл
		Если СтрокаТоваров.Номенклатура = Д.Ноутбук1 Тогда
			СтрокаТоваров.Количество = 4;
		КонецЕсли;
	КонецЦикла;
	Отгрузка.Записать(РежимЗаписиДокумента.Проведение);

	// Розничная продажа в магазине без заказа
	Продажа = Документы.РеализацияТоваров.СоздатьДокумент();
	Продажа.Дата = ДатаДокумента(Сегодня, 2);
	Продажа.Контрагент = Д.КлиентИП;
	Продажа.Склад = Д.Магазин;
	ДобавитьСтроки(Продажа, ТаблицаПозиций(НоваяПозиция(Д.Ноутбук1, 1), НоваяПозиция(Д.Мышь, 3)));
	Продажа.Записать(РежимЗаписиДокумента.Проведение);

	// Новый заказ без резерва
	НовыйЗаказ = Документы.ЗаказКлиента.СоздатьДокумент();
	НовыйЗаказ.Дата = ДатаДокумента(Сегодня, 1);
	НовыйЗаказ.Контрагент = Д.КлиентИП;
	НовыйЗаказ.Склад = Д.ОсновнойСклад;
	НовыйЗаказ.ДатаОтгрузки = Сегодня + 3 * 86400;
	ДобавитьСтроки(НовыйЗаказ, ТаблицаПозиций(НоваяПозиция(Д.Клавиатура, 10), НоваяПозиция(Д.Мышь, 10)));
	НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

#Область Конструкторы

Функция СоздатьЕдиницу(Код, Наименование, ПолноеНаименование)

	Объект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	Объект.Код = Код;
	Объект.Наименование = Наименование;
	Объект.ПолноеНаименование = ПолноеНаименование;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

Функция СоздатьСклад(Наименование, Адрес)

	Объект = Справочники.Склады.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.Адрес = Адрес;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

Функция СоздатьГруппу(МенеджерСправочника, Наименование)

	Объект = МенеджерСправочника.СоздатьГруппу();
	Объект.Наименование = Наименование;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

Функция СоздатьКонтрагента(Группа, Наименование, ЮрФизЛицо, ИНН, КПП)

	Объект = Справочники.Контрагенты.СоздатьЭлемент();
	Объект.Родитель = Группа;
	Объект.Наименование = Наименование;
	Объект.ЮрФизЛицо = ЮрФизЛицо;
	Объект.ИНН = ИНН;
	Объект.КПП = КПП;
	Если Не Объект.ПроверитьЗаполнение() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнен контрагент %1: %2'"), Наименование,
			ОбщегоНазначения.ЗабратьСообщенияПользователю());
	КонецЕсли;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

Функция СоздатьНоменклатуру(Группа, Артикул, Наименование, ТипНоменклатуры, ЕдиницаИзмерения)

	Объект = Справочники.Номенклатура.СоздатьЭлемент();
	Объект.Родитель = Группа;
	Объект.Артикул = Артикул;
	Объект.Наименование = Наименование;
	Объект.ТипНоменклатуры = ТипНоменклатуры;
	Объект.ЕдиницаИзмерения = ЕдиницаИзмерения;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

Процедура СоздатьПоступление(Дата, Поставщик, Склад, НомерВходящего, Позиции)

	ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ДокументОбъект.Дата = Дата;
	ДокументОбъект.Контрагент = Поставщик;
	ДокументОбъект.Склад = Склад;
	ДокументОбъект.НомерВходящегоДокумента = НомерВходящего;
	ДобавитьСтроки(ДокументОбъект, Позиции);
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура ДобавитьЦену(ДокументОбъект, Номенклатура, Цена)

	НоваяСтрока = ДокументОбъект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Цена = Цена;

КонецПроцедуры

Процедура ДобавитьСтроки(ДокументОбъект, Позиции)

	Для Каждого Позиция Из Позиции Цикл
		ЗаполнитьЗначенияСвойств(ДокументОбъект.Товары.Добавить(), Позиция);
	КонецЦикла;

КонецПроцедуры

Функция НоваяПозиция(Номенклатура, Количество, Цена = 0)

	Возврат Новый Структура("Номенклатура, Количество, Цена", Номенклатура, Количество, Цена);

КонецФункции

Функция ТаблицаПозиций(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено)

	Результат = Новый Массив;
	ДобавитьПозицию(Результат, П1);
	ДобавитьПозицию(Результат, П2);
	ДобавитьПозицию(Результат, П3);
	ДобавитьПозицию(Результат, П4);
	ДобавитьПозицию(Результат, П5);
	Возврат Результат;

КонецФункции

Процедура ДобавитьПозицию(Позиции, Позиция)

	Если Позиция <> Неопределено Тогда
		Позиции.Добавить(Позиция);
	КонецЕсли;

КонецПроцедуры

// Дата документа: N дней назад, в рабочее время (минуты разводят документы одного дня).
//
// Параметры:
//  Сегодня - Дата - начало текущего дня.
//  ДнейНазад - Число - сколько дней назад.
//
// Возвращаемое значение:
//  Дата - дата документа.
//
Функция ДатаДокумента(Сегодня, ДнейНазад)

	Возврат Сегодня - ДнейНазад * 86400 + 10 * 3600 + ДнейНазад * 60;

КонецФункции

#КонецОбласти

#КонецОбласти
